<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>万年历</title>
</head>
<body>
	<center>
		<?php
			//获取时间年,和在地址栏获取信息
			$y=@$_GET['y']?$_GET['y']:date('Y');
			//获取时间月,和在地址栏获取信息
			$m=@$_GET['m']?$_GET['m']:date('m');
			//获取时间天数,
			$b=date('t',mktime(0,0,0,$m,1,$y));
			//获取每个月1号是星期几
			$w=date('w',mktime(0,0,0,$m,1,$y));
			$dy=date('y');
			$dm=date('m');

			echo "<h3>{$y}年{$m}月</h3>";
		?>
		<!-- //表格 -->
		<table border='1' width="600">
			<tr>
				<td>星期日</td>
				<td>星期一</td>
				<td>星期二</td>
				<td>星期三</td>
				<td>星期四</td>
				<td>星期五</td>
				<td>星期六</td>
			</tr>
			<tr>
			<?php
				//命名一个为几号的变量,每个月都是1号开始
				$a=1;
				//循环让$a自加直到当月天数
				while($a<$b){
					echo '<tr>';
					//循环让$i循环7次,因为一周只有7天
					for($i=0;$i<7;$i++){
						//判断当每月1号在星期几的位置,和$a不得大与每个月的天数
						if(($i<$w&&$a==1)||$a>$b){
							//当符合判断条件的时候输出空格
							echo '<td>&#160;</td>';
						}else{
							//当不符合判断条件的时候输出$a.$a自加直到不符合条件
							echo "<td>{$a}</td>";
							$a++;
						}
						
					}
					
					echo '</tr>';
				}
			?>
			</tr>
		</table>
		<?php
			//命明一个变量等于今年的年号
			$sy=$y;
			//当点击上一个月时,当月月数变量$sm-1,
			$sm=$m-1;
			//判断当连续点击上一个月直到一月的时候,$sm持续-1,直到小于1的时候,$sm=12,并且,年号-1,
			if($sm<1){
				$sm=12;
				$sy=$y-1;
			}
			//命明一个变量等于今年的年号
			$xy=$y;
			//当点击下一个月时,当月月数变量$xm+1,
			$xm=$m+1;
			//判断当连续点击下一个月直到十二月的时候,$xm持续+1,直到大于12的时候,$xm=1,并且,年号+1,
			if($xm>12){
				$xm=1;
				$xy=$y+1;
			}
			//当点击上一年的时候,年号-1
			$sn=$y-1;
			//当点击下一年的时候,年号+1
			$xn=$y+1;
			echo "<a href='wannianli1.php?y={$sn}&m={$m}'>上一年</a>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;";
			echo "<a href='wannianli1.php?y={$sy}&m={$sm}'>上个月</a>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;";
			echo "<a href='wannianli1.php?y={$dy}&m={$dm}'>返回当月</a>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;";
			echo "<a href='wannianli1.php?y={$xy}&m={$xm}'>下个月</a>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;";
			echo "<a href='wannianli1.php?y={$xn}&m={$m}'>下一年</a>";
		?>
	</center>
</body>
</html>